tanakamasayuki/ESP32IRPulseKit/src/codec/Decoder.h
#pragma once

#include "../ESP32IRPulseKit.h"
#include <algorithm>
#include <cstring>

namespace esp32irpk::codec
{

  namespace detail
  {
    constexpr uint32_t kTickUs = 10;

    inline uint32_t ticksToUs(uint16_t ticks)
    {
      return static_cast<uint32_t>(ticks) * kTickUs;
    }

    inline uint32_t absDiff(uint32_t a, uint32_t b)
    {
      return (a > b) ? (a - b) : (b - a);
    }

    inline uint16_t errorPct(uint32_t actual_us, uint32_t expected_us)
    {
      if (expected_us == 0)
        return actual_us == 0 ? 0 : 100;
      uint32_t diff = absDiff(actual_us, expected_us);
      return static_cast<uint16_t>((diff * 100U + (expected_us / 2U)) / expected_us);
    }

    inline bool withinTol(uint32_t actual_us, uint32_t expected_us, uint16_t tol_pct)
    {
      if (expected_us == 0)
        return actual_us == 0;
      uint32_t diff = absDiff(actual_us, expected_us);
      return (diff * 100U) <= (expected_us * tol_pct);
    }

    struct PulseMatch
    {
      bool ok = false;
      uint16_t error_pct = 0;
    };

    inline PulseMatch matchPulse(uint32_t actual_us, uint32_t expected_us, uint16_t tol_pct)
    {
      PulseMatch out{};
      out.error_pct = errorPct(actual_us, expected_us);
      out.ok = withinTol(actual_us, expected_us, tol_pct);
      return out;
    }

    inline bool consumePulse(const IRRawTickView &raw,
                             size_t &idx,
                             uint32_t expected_us,
                             uint16_t tol_pct,
                             uint32_t &error_sum)
    {
      if (expected_us == 0)
        return true;
      if (idx >= raw.len)
        return false;
      uint32_t actual_us = ticksToUs(raw.ticks[idx]);
      PulseMatch m = matchPulse(actual_us, expected_us, tol_pct);
      if (!m.ok)
        return false;
      error_sum += m.error_pct;
      ++idx;
      return true;
    }

    inline int16_t finalizeScore(uint32_t error_sum)
    {
      int32_t score = 1000 - static_cast<int32_t>(error_sum);
      if (score > 32767)
        score = 32767;
      if (score < -32768)
        score = -32768;
      return static_cast<int16_t>(score);
    }

    inline int16_t finalizeWeightedScore(uint32_t header_err,
                                         uint32_t body_err,
                                         uint32_t extra_err = 0)
    {
      uint64_t weighted = static_cast<uint64_t>(header_err) * 8ULL +
                          static_cast<uint64_t>(body_err) +
                          static_cast<uint64_t>(extra_err);
      // scale down to reduce over-penalizing while keeping header impact higher
      uint32_t scaled = static_cast<uint32_t>((weighted + 3ULL) / 4ULL);
      return finalizeScore(scaled);
    }

    inline void adjustFamilyScore(const IRProtocolSpec &spec,
                                  const IRDecodedBits &decoded,
                                  int16_t &score)
    {
      switch (spec.family)
      {
      case IRProtocolFamily::AEHA:
      {
        if (decoded.bit_length >= 20)
        {
          uint16_t customer = static_cast<uint16_t>(decoded.bits & 0xFFFFu);
          uint8_t parity = static_cast<uint8_t>((decoded.bits >> 16) & 0xFu);
          uint8_t expected = static_cast<uint8_t>((customer ^ (customer >> 4) ^ (customer >> 8) ^ (customer >> 12)) & 0xFu);
          if (parity == expected)
          {
            score += 20;
          }
          else
          {
            score -= 40;
          }
        }
        break;
      }
      case IRProtocolFamily::PANASONIC:
      {
        // No special check for now
        break;
      }
      default:
        break;
      }
    }

    inline size_t maybeTrimByGap(const IRRawTickView &raw, const IRProtocolSpec &spec)
    {
      if (spec.gap_threshold_us == 0 || raw.len == 0)
        return raw.len;

      uint32_t gap_ticks = (spec.gap_threshold_us + (kTickUs - 1)) / kTickUs;

      // minimal symbols to consider a complete frame before gap:
      size_t min_symbols = 0;
      if (spec.header.mark_us)
        min_symbols += 1;
      if (spec.header.space_us)
        min_symbols += 1;
      if (spec.trailer.mark_us)
        min_symbols += 1;
      if (spec.trailer.space_us)
        min_symbols += 1;
      uint16_t max_bits = spec.max_bit_length ? spec.max_bit_length : spec.bit_length;
      min_symbols += static_cast<size_t>(max_bits) * 2;

      size_t symbols = raw.len;
      for (size_t i = 0; i < raw.len; ++i)
      {
        if ((i % 2) == 1) // space index
        {
          if (raw.ticks[i] >= gap_ticks && i + 1 >= min_symbols)
          {
            symbols = i + 1;
            break;
          }
        }
      }
      return symbols;
    }

    inline bool decodeNormal(const IRRawTickView &raw,
                             const IRProtocolSpec &spec,
                             IRDecodedBits &decoded,
                             int16_t &score_out,
                             esp32irpk::IRScoreDetail *detail_out = nullptr)
    {
      uint16_t min_bits = spec.min_bit_length ? spec.min_bit_length : spec.bit_length;
      uint16_t max_bits = spec.max_bit_length ? spec.max_bit_length : spec.bit_length;
      if (min_bits == 0 || max_bits == 0 || min_bits > max_bits)
        return false;
      size_t header_syms = 0;
      if (spec.header.mark_us)
        header_syms++;
      if (spec.header.space_us)
        header_syms++;
      size_t trailer_syms = 0;
      if (spec.trailer.mark_us)
        trailer_syms++;
      if (spec.trailer.space_us)
        trailer_syms++;
      if (raw.len < header_syms + trailer_syms + static_cast<size_t>(min_bits) * 2)
        return false;

      size_t bit_syms = raw.len - header_syms - trailer_syms;
      if (bit_syms % 2 != 0)
        return false;
      size_t bit_count_sz = bit_syms / 2;
      if (bit_count_sz < min_bits || bit_count_sz > max_bits)
        return false;
      uint16_t bit_count = static_cast<uint16_t>(bit_count_sz);
      size_t idx = 0;
      uint32_t header_err = 0;
      uint32_t body_err = 0;
      uint32_t extra_err = 0;

