tanakamasayuki/ESP32IRPulseKit/src/codec/Decoder.h
      if (!consumePulse(raw, idx, spec.header.mark_us, spec.bit_tol_pct, header_err) ||
          !consumePulse(raw, idx, spec.header.space_us, spec.bit_tol_pct, header_err))
        return false;

      uint64_t bits = 0;
      for (uint16_t i = 0; i < bit_count; ++i)
      {
        uint32_t mark_us = ticksToUs(raw.ticks[idx]);
        uint32_t space_us = 0;
        bool has_space = (idx + 1 < raw.len);
        if (has_space)
          space_us = ticksToUs(raw.ticks[idx + 1]);

        bool is_last_bit = (i + 1 == bit_count);
        bool space_is_gap = false;
        if (is_last_bit)
        {
          if (has_space && spec.gap_threshold_us > 0)
            space_is_gap = space_us >= spec.gap_threshold_us;
          else if (!has_space)
            space_is_gap = true; // allow clipped gap
        }
        else if (!has_space)
        {
          return false;
        }

        PulseMatch one_mark = matchPulse(mark_us, spec.one.mark_us, spec.bit_tol_pct);
        PulseMatch one_space = space_is_gap ? PulseMatch{true, 0}
                                            : matchPulse(space_us, spec.one.space_us, spec.bit_tol_pct);
        PulseMatch zero_mark = matchPulse(mark_us, spec.zero.mark_us, spec.bit_tol_pct);
        PulseMatch zero_space = space_is_gap ? PulseMatch{true, 0}
                                             : matchPulse(space_us, spec.zero.space_us, spec.bit_tol_pct);

        bool one_ok = one_mark.ok && one_space.ok;
        bool zero_ok = zero_mark.ok && zero_space.ok;
        if (!one_ok && !zero_ok)
          return false;

        uint32_t one_err = static_cast<uint32_t>(one_mark.error_pct + one_space.error_pct);
        uint32_t zero_err = static_cast<uint32_t>(zero_mark.error_pct + zero_space.error_pct);
        bool bit_is_one = false;
        uint32_t bit_err = 0;

        if (one_ok && (!zero_ok || one_err <= zero_err))
        {
          bit_is_one = true;
          bit_err = one_err;
        }
        else
        {
          bit_is_one = false;
          bit_err = zero_err;
        }

        if (spec.lsb_first)
        {
          if (bit_is_one)
            bits |= (1ULL << i);
        }
        else
        {
          if (bit_is_one)
            bits |= (1ULL << (bit_count - 1 - i));
        }

        body_err += bit_err;
        idx += 2;
      }

      if (!consumePulse(raw, idx, spec.trailer.mark_us, spec.bit_tol_pct, header_err) ||
          !consumePulse(raw, idx, spec.trailer.space_us, spec.bit_tol_pct, header_err))
        return false;

      if (idx < raw.len)
      {
        if (raw.len - idx == 1)
        {
          // trailing gap: ignore without penalty
          ++idx;
        }
        else
        {
          return false;
        }
      }

      decoded.protocol_id = spec.protocol_id;
      decoded.frame_type = IRFrameType::NORMAL;
      decoded.bit_length = bit_count;
      decoded.bits = bits;

      uint64_t weighted = static_cast<uint64_t>(header_err) * 8ULL +
                          static_cast<uint64_t>(body_err) +
                          static_cast<uint64_t>(extra_err);
      uint32_t scaled = static_cast<uint32_t>((weighted + 3ULL) / 4ULL);
      score_out = finalizeScore(scaled);

      if (detail_out)
      {
        detail_out->header_err_pct_sum = static_cast<uint16_t>(std::min<uint32_t>(header_err, 0xFFFFu));
        detail_out->body_err_pct_sum = static_cast<uint16_t>(std::min<uint32_t>(body_err, 0xFFFFu));
        detail_out->extra_err_pct_sum = static_cast<uint16_t>(std::min<uint32_t>(extra_err, 0xFFFFu));
        detail_out->weighted_err_scaled = static_cast<uint16_t>(std::min<uint32_t>(scaled, 0xFFFFu));
        detail_out->score_base = score_out;
        detail_out->family_adjust = 0;
      }
      return true;
    }

    inline bool decodeRepeat(const IRRawTickView &raw,
                             const IRProtocolSpec &spec,
                             IRDecodedBits &decoded,
                             int16_t &score_out,
                             esp32irpk::IRScoreDetail *detail_out = nullptr)
    {
      if (!spec.has_repeat)
        return false;
      size_t idx = 0;
      uint32_t header_err = 0;
      uint32_t body_err = 0;
      uint32_t extra_err = 0;

      if (!consumePulse(raw, idx, spec.repeat_header.mark_us, spec.bit_tol_pct, header_err) ||
          !consumePulse(raw, idx, spec.repeat_header.space_us, spec.bit_tol_pct, header_err))
        return false;

      if (!consumePulse(raw, idx, spec.trailer.mark_us, spec.bit_tol_pct, header_err) ||
          !consumePulse(raw, idx, spec.trailer.space_us, spec.bit_tol_pct, header_err))
        return false;

      if (idx < raw.len)
      {
        if (raw.len - idx == 1)
        {
          uint32_t gap_us = ticksToUs(raw.ticks[idx]);
          uint32_t expected_gap = 0;
          if (spec.repeat_gap_us > 0)
          {
            uint64_t consumed_us = 0;
            for (size_t j = 0; j < idx; ++j)
              consumed_us += ticksToUs(raw.ticks[j]);
            if (consumed_us < spec.repeat_gap_us)
              expected_gap = static_cast<uint32_t>(spec.repeat_gap_us - consumed_us);
          }
          else if (spec.gap_threshold_us > 0)
          {
            expected_gap = spec.gap_threshold_us;
          }
          if (expected_gap > 0)
            extra_err += errorPct(gap_us, expected_gap);
          ++idx;
        }
        else
        {
          return false;
        }
      }

      decoded.protocol_id = spec.protocol_id;
      decoded.frame_type = IRFrameType::REPEAT;
      decoded.bit_length = 0;
      decoded.bits = 0xFFFFFFFFFFFFFFFFULL;

      uint64_t weighted = static_cast<uint64_t>(header_err) * 8ULL +
                          static_cast<uint64_t>(body_err) +
                          static_cast<uint64_t>(extra_err);
      uint32_t scaled = static_cast<uint32_t>((weighted + 3ULL) / 4ULL);
      score_out = finalizeScore(scaled);

      if (detail_out)
      {
        detail_out->header_err_pct_sum = static_cast<uint16_t>(std::min<uint32_t>(header_err, 0xFFFFu));
        detail_out->body_err_pct_sum = static_cast<uint16_t>(std::min<uint32_t>(body_err, 0xFFFFu));
        detail_out->extra_err_pct_sum = static_cast<uint16_t>(std::min<uint32_t>(extra_err, 0xFFFFu));
        detail_out->weighted_err_scaled = static_cast<uint16_t>(std::min<uint32_t>(scaled, 0xFFFFu));
        detail_out->score_base = score_out;
        detail_out->family_adjust = 0;
      }
      return true;
    }

    template <size_t MaxCandidates>
    inline void insertCandidate(IRReceiveResult<MaxCandidates> &out,
                                uint8_t max_candidates,
                                const IRDecodeCandidate &cand)
    {
      if (max_candidates == 0)
        return;
      uint8_t limit = max_candidates > MaxCandidates ? MaxCandidates : max_candidates;
      if (limit == 0)
        return;

      if (out.count < limit)
      {
        out.candidates[out.count] = cand;
        ++out.count;
      }
      else
      {
        if (cand.score < out.candidates[limit - 1].score)
          return;
        if (cand.score == out.candidates[limit - 1].score &&
            cand.order >= out.candidates[limit - 1].order)
          return;
        out.candidates[limit - 1] = cand;
      }

      for (int i = static_cast<int>(out.count) - 1; i > 0; --i)
      {
        bool better = out.candidates[i].score > out.candidates[i - 1].score;
        if (!better && out.candidates[i].score == out.candidates[i - 1].score)
          better = out.candidates[i].order < out.candidates[i - 1].order;
        if (better)
        {
          IRDecodeCandidate tmp = out.candidates[i - 1];
          out.candidates[i - 1] = out.candidates[i];
          out.candidates[i] = tmp;
        }
        else
        {
          break;
        }
      }
    }
  } // namespace detail

  namespace rc_detail
  {
    inline bool appendHalves(uint32_t duration_us,
                             uint32_t unit_us,
                             uint16_t tol_pct,
                             bool &level,
                             std::vector<bool> &halves,
                             uint32_t &err_sum)
    {
      if (unit_us == 0)
        return false;
      uint32_t units = (duration_us + unit_us - 1U) / unit_us; // ceil to avoid losing halves
      if (units == 0)
        return false;
      uint32_t expected = units * unit_us;
      err_sum += detail::errorPct(duration_us, expected);
      for (uint32_t i = 0; i < units; ++i)
      {
        halves.push_back(level);
        level = !level; // Manchester toggles every half-bit
      }
      return true;
    }

    inline bool buildHalves(const IRRawTickView &raw,
                            size_t start_idx,
                            uint32_t unit_us,
                            uint16_t tol_pct,
                            std::vector<bool> &halves,
                            uint32_t &err_sum)
    {
      bool level = true; // starts with mark
      for (size_t i = start_idx; i < raw.len; ++i)
      {
        uint32_t dur = detail::ticksToUs(raw.ticks[i]);
        if (!appendHalves(dur, unit_us, tol_pct, level, halves, err_sum))
          return false;
      }
      return true;
    }

    inline bool decodeManBit(const std::vector<bool> &halves,
                             size_t idx,
                             size_t half_count,
                             bool &bit_out)
    {
      if (idx + half_count > halves.size() || half_count < 2 || (half_count % 2) != 0)
        return false;
      bool first = halves[idx];
      bool mid = halves[idx + half_count / 2];
      if (first == mid)
        return false;
      bit_out = first; // high->low = 1, low->high = 0
      return true;
    }

    inline bool decodeRC5(const IRRawTickView &raw,
                          const IRProtocolSpec &spec,
                          IRDecodedBits &decoded,
                          int16_t &score_out,
                          esp32irpk::IRScoreDetail *detail_out = nullptr)
    {
      const uint32_t unit_us = 889;
      const size_t bits = 14;
      if (raw.len < 2)
        return false;

      std::vector<bool> halves;
      uint32_t err_sum = 0;
      if (!buildHalves(raw, 0, unit_us, spec.bit_tol_pct, halves, err_sum))
        return false;
      if (halves.size() < bits * 2)
        return false;
      if (halves.size() > bits * 2)
        halves.resize(bits * 2);

