tanakamasayuki/ESP32IRPulseKit/src/codec/Decoder.h
      uint64_t bits_out = 0;
      for (size_t i = 0; i < bits; ++i)
      {
        bool bit = false;
        if (!decodeManBit(halves, i * 2, 2, bit))
          return false;
        size_t pos = spec.lsb_first ? i : (bits - 1 - i);
        if (bit)
          bits_out |= (1ULL << pos);
      }

      // Start bits (first two) should be 1
      if (!((bits_out >> (bits - 1)) & 0x1ULL))
        err_sum += 50;
      if (!((bits_out >> (bits - 2)) & 0x1ULL))
        err_sum += 50;

      decoded.protocol_id = spec.protocol_id;
      decoded.frame_type = IRFrameType::NORMAL;
      decoded.bit_length = bits;
      decoded.bits = bits_out;
      score_out = detail::finalizeScore(err_sum);
      if (detail_out)
      {
        detail_out->header_err_pct_sum = 0;
        detail_out->body_err_pct_sum = static_cast<uint16_t>(std::min<uint32_t>(err_sum, 0xFFFFu));
        detail_out->extra_err_pct_sum = 0;
        detail_out->weighted_err_scaled = static_cast<uint16_t>(std::min<uint32_t>(err_sum, 0xFFFFu));
        detail_out->score_base = score_out;
        detail_out->family_adjust = 0;
      }
      return true;
    }

    inline bool decodeRC6Common(const IRRawTickView &raw,
                                const IRProtocolSpec &spec,
                                uint8_t mode_expect,
                                uint16_t payload_bits,
                                bool has_toggle,
                                IRDecodedBits &decoded,
                                int16_t &score_out,
                                esp32irpk::IRScoreDetail *detail_out = nullptr)
    {
      const uint32_t unit_us = 444;
      if (raw.len < 2)
        return false;

      size_t idx = 0;
      uint32_t header_err = 0;
      // Leader: 6T mark + 2T space
      uint32_t lead_mark = detail::ticksToUs(raw.ticks[idx]);
      uint32_t lead_space = (idx + 1 < raw.len) ? detail::ticksToUs(raw.ticks[idx + 1]) : 0;
      header_err += detail::errorPct(lead_mark, unit_us * 6U);
      if (raw.ticks[idx] == 0 || raw.ticks[idx + 1] == 0)
        return false;
      header_err += detail::errorPct(lead_space, unit_us * 2U);
      idx += 2;

      std::vector<bool> halves;
      uint32_t body_err = 0;
      if (!buildHalves(raw, idx, unit_us, spec.bit_tol_pct, halves, body_err))
        return false;

      size_t start_bit_halves = 4; // double width
      size_t toggle_halves = has_toggle ? 4 : 0;
      size_t total_bits = 1 + 3 + (has_toggle ? 1 : 0) + payload_bits;
      size_t expected_halves = start_bit_halves + toggle_halves + (total_bits - 1 - (has_toggle ? 1 : 0)) * 2 + (has_toggle ? 0 : 0);
      if (halves.size() < expected_halves)
        return false;
      size_t pos = 0;

      auto decodeBitWidth = [&](size_t width_halves, bool &bit_out) -> bool
      {
        if (!decodeManBit(halves, pos, width_halves, bit_out))
          return false;
        pos += width_halves;
        return true;
      };

      uint64_t bits_out = 0;
      size_t bit_index = 0;

      bool bit = false;
      if (!decodeBitWidth(start_bit_halves, bit))
        return false;
      size_t target = spec.lsb_first ? bit_index : (total_bits - 1 - bit_index);
      if (bit)
        bits_out |= (1ULL << target);
      bit_index++;

      uint8_t mode = 0;
      for (int i = 0; i < 3; ++i, ++bit_index)
      {
        if (!decodeBitWidth(2, bit))
          return false;
        if (bit)
          mode |= (1U << (2 - i)); // MSB first for mode
        target = spec.lsb_first ? bit_index : (total_bits - 1 - bit_index);
        if (bit)
          bits_out |= (1ULL << target);
      }

      if (mode != mode_expect)
        body_err += 80;

      if (has_toggle)
      {
        if (!decodeBitWidth(toggle_halves, bit))
          return false;
        target = spec.lsb_first ? bit_index : (total_bits - 1 - bit_index);
        if (bit)
          bits_out |= (1ULL << target);
        ++bit_index;
      }

      for (uint16_t p = 0; p < payload_bits; ++p, ++bit_index)
      {
        if (!decodeBitWidth(2, bit))
          return false;
        target = spec.lsb_first ? bit_index : (total_bits - 1 - bit_index);
        if (bit)
          bits_out |= (1ULL << target);
      }

      decoded.protocol_id = spec.protocol_id;
      decoded.frame_type = IRFrameType::NORMAL;
      decoded.bit_length = static_cast<uint16_t>(total_bits);
      decoded.bits = bits_out;
      uint64_t weighted = static_cast<uint64_t>(header_err) * 8ULL +
                          static_cast<uint64_t>(body_err);
      uint32_t scaled = static_cast<uint32_t>((weighted + 3ULL) / 4ULL);
      score_out = detail::finalizeScore(scaled);
      if (detail_out)
      {
        detail_out->header_err_pct_sum = static_cast<uint16_t>(std::min<uint32_t>(header_err, 0xFFFFu));
        detail_out->body_err_pct_sum = static_cast<uint16_t>(std::min<uint32_t>(body_err, 0xFFFFu));
        detail_out->extra_err_pct_sum = 0;
        detail_out->weighted_err_scaled = static_cast<uint16_t>(std::min<uint32_t>(scaled, 0xFFFFu));
        detail_out->score_base = score_out;
        detail_out->family_adjust = 0;
      }
      return true;
    }

    inline bool decodeRC6M0(const IRRawTickView &raw,
                            const IRProtocolSpec &spec,
                            IRDecodedBits &decoded,
                            int16_t &score_out,
                            esp32irpk::IRScoreDetail *detail_out = nullptr)
    {
      return decodeRC6Common(raw, spec, /*mode_expect=*/0, /*payload_bits=*/16, /*has_toggle=*/true, decoded, score_out, detail_out);
    }

    inline bool decodeRC6M6(const IRRawTickView &raw,
                            const IRProtocolSpec &spec,
                            IRDecodedBits &decoded,
                            int16_t &score_out,
                            esp32irpk::IRScoreDetail *detail_out = nullptr)
    {
      return decodeRC6Common(raw, spec, /*mode_expect=*/6, /*payload_bits=*/32, /*has_toggle=*/false, decoded, score_out, detail_out);
    }
  } // namespace rc_detail

  template <size_t MaxCandidates>
  bool decodeRawToBits(const IRRawTickView &raw,
                       const IRProtocolSpec *specs,
                       size_t spec_count,
                       uint8_t max_candidates,
                       int16_t score_threshold,
                       IRReceiveResult<MaxCandidates> &out)
  {
    out.count = 0;
    if (!specs || spec_count == 0)
      return false;
    if (!raw.ticks || raw.len == 0)
      return false;
    if (max_candidates == 0)
      return false;

