tanakamasayuki/ESP32IRPulseKit/src/codec/Decoder.h
    out.raw = raw;

    for (size_t i = 0; i < spec_count; ++i)
    {
      const IRProtocolSpec &spec = specs[i];
      IRDecodedBits decoded{};
      int16_t score = 0;
      size_t effective_len = raw.len;
      bool ok = false;
      esp32irpk::IRScoreDetail score_detail{};

      if (spec.scheme == IRProtocolScheme::SPACE_ENC)
      {
        effective_len = detail::maybeTrimByGap(raw, spec);
        size_t decode_len = effective_len;

        // Drop a trailing gap tick from the decode view if it would leave an odd bit symbol count.
        if (decode_len > 0)
        {
          size_t header_syms = 0;
          if (spec.header.mark_us)
            header_syms++;
          if (spec.header.space_us)
            header_syms++;
          size_t trailer_syms = 0;
          if (spec.trailer.mark_us)
            trailer_syms++;
          if (spec.trailer.space_us)
            trailer_syms++;

          if (decode_len > header_syms + trailer_syms)
          {
            size_t bit_syms = decode_len - header_syms - trailer_syms;
            bool last_is_space = ((decode_len % 2) == 0); // mark-first streams end on space when a gap is present
            if (last_is_space && (bit_syms % 2) != 0)
            {
              bool gap_candidate = (spec.gap_threshold_us == 0);
              uint32_t tail_us = detail::ticksToUs(raw.ticks[decode_len - 1]);
              if (!gap_candidate)
                gap_candidate = tail_us >= spec.gap_threshold_us;
              if (gap_candidate)
                --decode_len;
            }
          }
        }

        IRRawTickView sub_raw = raw;
        sub_raw.len = decode_len;

        ok = detail::decodeNormal(sub_raw, spec, decoded, score, &score_detail);
        if (!ok && spec.has_repeat)
        {
          score_detail = esp32irpk::IRScoreDetail{};
          ok = detail::decodeRepeat(sub_raw, spec, decoded, score, &score_detail);
        }
      }
      else if (spec.scheme == IRProtocolScheme::BIPHASE)
      {
        switch (spec.protocol_id)
        {
        case IRProtocolID::RC5:
          ok = rc_detail::decodeRC5(raw, spec, decoded, score, &score_detail);
          break;
        case IRProtocolID::RC6_M0_16:
          ok = rc_detail::decodeRC6M0(raw, spec, decoded, score, &score_detail);
          break;
        case IRProtocolID::RC6_M6_32:
          ok = rc_detail::decodeRC6M6(raw, spec, decoded, score, &score_detail);
          break;
        default:
          ok = false;
          break;
        }
      }

      if (!ok)
        continue;

      IRDecodeCandidate cand{};
      cand.protocol_id = decoded.protocol_id;
      if (spec.name[0] != '\0')
      {
        std::strncpy(cand.name, spec.name, sizeof(cand.name) - 1);
        cand.name[sizeof(cand.name) - 1] = '\0';
      }
      cand.order = spec.order;
      cand.consumed_len = effective_len;
      cand.score = score;
      cand.decoded = decoded;
      cand.score_detail = score_detail;
      detail::adjustFamilyScore(spec, cand.decoded, cand.score);
      int32_t fam_adj = static_cast<int32_t>(cand.score) - static_cast<int32_t>(cand.score_detail.score_base);
      if (fam_adj > 32767)
        fam_adj = 32767;
      else if (fam_adj < -32768)
        fam_adj = -32768;
      cand.score_detail.family_adjust = static_cast<int16_t>(fam_adj);
      if (cand.score < score_threshold)
        continue;
      detail::insertCandidate(out, max_candidates, cand);
    }

    if (out.count > 0)
    {
      size_t consumed = out.candidates[0].consumed_len > 0 ? out.candidates[0].consumed_len
                                                           : out.raw.len;
      if (consumed < out.raw.len)
        out.raw.len = consumed;
    }

    return out.count > 0;
  }

} // namespace esp32irpk::codec
